#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	double a, L1, L2, L3, L4, L5, L6;
	printf("请输入你的利润：\n");
	scanf("%lf", &a);
	L1 = 100000 * 0.1;
	L2 = L1 + (200000 - 100000) * 0.075;
	L3 = L2 + (400000 - 200000) * 0.05;
	L4 = L3 + (600000 - 400000) * 0.03;
	L5 = L4 + (1000000 - 600000) * 0.015;
	if (a <= 100000) { a = a * 0.1; }
	else if (100000 < a <= 200000) { a = L1 + (a - 100000) * 0.075; }
	else if (200000 < a <= 400000) { a = L2 + (a - 200000) * 0.05; }
	else if (400000 < a <= 600000) { a = L3 + (a - 400000) * 0.03; }
	else if (600000 < a <= 1000000) { a = L4 + (a - 600000) * 0.015; }
	else if (a > 1000000) { a = L5 + (a - 1000000) * 0.01; }
	printf("你的奖金是：%lf", a);

	return 0;
}